import { createStore } from "vuex";

export default createStore({
  state: {
    accessoriesKV_4: [
      "Пушка  107 мм ЗиС-6",
      "Пушка  122 мм Д-2-5Т",
      "Пушка  107 мм ЗиС-24",
      "Пушка  122 мм Д-25ТС",
      "Двигатель  М-40 1000",
      "Двигатель  2х В-2К-Ф",
      "Подвеска  КВ-4",
      "Подвеска  КВ-4 Бис"
    ],
    accessoriesIS_3: [
      "Пушка  100 мм Д-10Т",
      "Пушка  122 мм Д-2-5Т",
      "Пушка  122 мм Д-25Т",
      "Пушка  122 мм БЛ-9",
      "Двигатель  В-11",
      "Двигатель  В-2-54ИС",
      "Подвеска  ИС-3",
      "Подвеска  ИС-3М"
    ],
    accessoriesSU_101: [
      "Пушка  100 мм Д-10С",
      "Пушка  100 мм Д-54С",
      "Пушка  122 мм М62-С2",
      "Пушка  122 мм Д-25-СУ-101",
      "Двигатель  В-2-44",
      "Двигатель  В-2-54",
      "Подвеска  СУ-101",
      "Подвеска  СУ-102"
    ],
  },
  getters: {},
  mutations: {},
  actions: {},
  modules: {},
});
