<template>
  <main class="main">
    <section class="section type">
      <img src="@/assets/images/Client_server.png" alt="Tank">
      <p class="typing">
        Получение данных с сервера.
      </p>
    </section>
    <section class="section kv-4">
      <img src="@/assets/images/Tank_images/Tank_KV-4_photo.jpg" alt="KV-4">
      <h2>Танк КВ-4</h2>
      <p>
        Советский тяжёлый танк. Обладает хорошим бронированием, точным орудием с хорошим бронепробитием, но низкой
        скоростью и плохой манёвренностью.
      </p>
      <p>
        В апреле 1941 года глава СКБ (Ж. Котин) объявил конкурс на разработку тяжелого танка КВ-4 с двумя орудиями,
        125—130 мм бронёй лобовой части корпуса. Свыше 20 конструкторов приступили к работе, около 20 проектов было
        готово. Победителем стал проект Н. Шашмурина, которы совместил установленное в корпусе 107 мм орудие с 76 мм
        пушкой Л-11 в башне от КВ-1. В июне все работы по КВ-4 были свернуты в пользу КВ-5.
      </p>
    </section>
    <section class="section is-3">
      <h2>Танк ИС-3</h2>
      <p>
        Советский тяжёлый танк восьмого уровня, предназначен для штурма или фланговых атак. Обладает великолепным
        бронированием, хорошей скоростью, мощным вооружением с долгим сведением и низкой точностью, плохим обзором и
        плохим склонением орудия вниз.
      </p>
      <p>
        Создание проекта нового тяжёлого танка под условным названием «Кировец-1» началось в конце лета 1944 года.
        Первая опытная партия тяжёлых танков ИС-3 покинула заводские цеха в мае 1945 года. Пушка снабжалась двухкамерным
        дульным тормозом и горизонтальным клиновым затвором с полуавтоматикой механического типа. Боекомплект пушки
        состоял из 28 снарядов раздельного заряжания, в том числе 18 с осколочно-фугасными снарядами и 10 с
        бронебойными. На крыше башни, на турели находился зенитный 12,7-мм пулемёт ДШК. Танк ИС-3 находился в серийном
        производстве до середины 1946 года.
      </p>
    </section>
    <section class="section su-101">
      <img src="@/assets/images/Tank_images/Tank_SU-101_photo.jpg" alt="SU-101">
      <h2>САУ СУ-101</h2>
      <p>
        Советская самоходная артиллерийская установка (САУ). Обладает хорошей динамикой и скорострельным и точным
        орудием, но имеет слабое бронирование и некомфортные углы вертикальной наводки.
      </p>
      <p>
        Опытная советская средняя САУ периода Второй мировой войны. Была создана в конструкторском осенью 1944 — весной
        1945 года на основе шасси средних танков Т-44 и Т-34-85 и предназначалась для замены САУ СУ-100. Несмотря на
        перспективность САУ и высокие для своего времени характеристики, с окончанием войны было принято решение о
        прекращении дальнейших работ по ним, в связи с нецелесообразностью развёртывания выпуска новой САУ. Опыт работы
        над СУ-101 и СУ-102, вместе с тем, был использован в работах над послевоенными проектами САУ.
      </p>
    </section>
    <section class="section shelby">
      <img src="@/assets/images/Tank_images/Shelby_Cobra.jpg" alt="Shelby Cobra">
      <h2>Shelby Cobra</h2>
      <p>
        Shelby Cobra является классикой своего образа благодаря своей неотразимой формой и относительно простой
        конструкции, в которой просто нет ничего лишнего. Но мало кто знает, что успех и признание этого автомобиля
        пришло только после того, как он был снят с производства.
      </p>
      <p>
        Наверняка, каждый мужчина мечтал хотя бы раз в жизни посидеть за рулем таких монстров, как Ferrari 250, Porsche
        911, Jaguar E-type, Aston Martin DB. Но, пожалуй, самой неповторимой атмосферой из всех классических спорткаров
        обладает Shelby Cobra — шедевр гоночного автомобилестроения эпохи 60-х. Создателем этого, без преувеличения,
        произведения искусства является Кэрролл Шелби — гениальный американский конструктор и по совместительству
        чемпион Ле-Мана 1959 года. Многие из вас, наверняка, видели «аппетитные» формы знаменитого спортивного
        автомобиля.
      </p>
    </section>
    <section class="section bitcoin">
      <img src="@/assets/images/Bitcoin.jpg" alt="Bitcoin">
      <h2>Биткоин и другие криптовалюты</h2>
      <p>
        Криптовалюта — разновидность цифровой валюты, учёт внутренних расчётных единиц которой обеспечивает
        децентрализованная платёжная система (нет внутреннего или внешнего администратора или какого-либо его аналога),
        работающая в полностью автоматическом режиме. Сама по себе криптовалюта не имеет какой-либо особой материальной
        или электронной формы — это просто число, обозначающее количество данных расчётных единиц, которое записывается
        в соответствующей позиции информационного пакета протокола передачи данных и зачастую даже не подвергается
        шифрованию, как и вся иная информация о транзакциях между адресами системы.
      </p>
      <p>
        Термин криптовалюта закрепился после публикации статьи o системе Биткоин «Crypto currency» (Криптографическая
        валюта), опубликованной в 2011 году в журнале Forbes. При этом и создатель биткоина, и многие другие авторы
        использовали термин «электронная наличность».
      </p>
    </section>
  </main>
</template>

<script>

export default {
  name: "MainPage",
  methods: {
    sectionTransition() {
      let sections = document.querySelectorAll(".section");
      sections.forEach((section) => {
        section.addEventListener("wheel", (e) => {
          e.preventDefault();
          if (e.deltaY >= 0 && section.nextElementSibling) {
            section.nextElementSibling.scrollIntoView({ behavior: "smooth" });
          } else if (e.deltaY < 0 && section.previousElementSibling) {
            section.previousElementSibling.scrollIntoView({ behavior: "smooth" });
          }
        });
      });
    }
  },
  mounted() {
    this.sectionTransition();
  }
};
</script>

<style lang="scss" scoped>
@import "@/styles/variables.scss";

.main {
  position: relative;
  background: url(@/assets/images/Tank_images/Tank_IS-3_photo.png) 50% 50% no-repeat;
  @include background();
  color: var(--color-bg-task);
  overflow-y: auto;
  font-size: 0.9em;

  .section {
    height: inherit;
    position: relative;

    h2 {
      padding-top: 10px;
      font-size: 1.3em;
    }

    p {
      text-align: justify;
      padding: 10px;
      margin-bottom: 0;
    }
  }

  .type {
    display: grid;
    place-items: center;
    background: var(--color-bg);
    @include image-position();
  }

  .kv-4,
  .su-101,
  .shelby,
  .bitcoin {
    background: var(--color-bg);
    @include image-position();
  }

  .typing {
    width: 26ch;
    animation: typing 2s steps(26), blink 1s step-end infinite alternate;
    white-space: nowrap;
    overflow: hidden;
    border-right: 3px solid;
    font-size: 2.2em;
  }

  @keyframes typing {
    from {
      width: 0;
    }
  }

  @keyframes blink {
    50% {
      border-color: transparent;
    }
  }
}

@media (max-width: 992px) {
  .main {
    font-size: 0.8em;
  }
}

@media (max-width: 768px) {
  .section {
    overflow-y: auto;
    overflow-x: hidden;
  }

  .main {
    font-size: 0.7em;
    height: calc(100vh - 130px);
  }
}
</style>
