<template>
  <main class="main">
    <section class="section">
      <h2>Танк КВ-4</h2>
      <p>
        Советский тяжёлый танк. Обладает хорошим бронированием, точным орудием с хорошим бронепробитием, но низкой скоростью и плохой манёвренностью.
      </p>
      <p>
        В апреле 1941 года глава СКБ (Ж. Котин) объявил конкурс на разработку тяжелого танка КВ-4 с двумя орудиями, 125—130 мм бронёй лобовой части корпуса. Свыше 20 конструкторов приступили к работе, около 20 проектов было готово. Победителем стал проект Н. Шашмурина, которы совместил установленное в корпусе 107 мм орудие с 76 мм пушкой Л-11 в башне от КВ-1. В июне все работы по КВ-4 были свернуты в пользу КВ-5.
      </p>
    </section>
    <section class="section">
      <h2>Танк ИС-3</h2>
      <p>
        Советский тяжёлый танк восьмого уровня, предназначен для штурма или фланговых атак. Обладает великолепным
        бронированием, хорошей скоростью, мощным вооружением с долгим сведением и низкой точностью, плохим обзором и плохим склонением орудия вниз.
      </p>
      <p>
        Создание проекта нового тяжёлого танка под условным названием «Кировец-1» началось в конце лета 1944 года. Первая опытная партия тяжёлых танков ИС-3 покинула заводские цеха в мае 1945 года. Пушка снабжалась двухкамерным дульным тормозом и горизонтальным клиновым затвором с полуавтоматикой механического типа. Боекомплект пушки состоял из 28 снарядов раздельного заряжания, в том числе 18 с осколочно-фугасными снарядами и 10 с бронебойными. На крыше башни, на турели находился зенитный 12,7-мм пулемёт ДШК. Танк ИС-3 находился в серийном производстве до середины 1946 года.
      </p>
    </section>
    <section class="section">
      <h2>ПТ-САУ СУ-101</h2>
      <p>
        Советская ПТ-САУ. Обладает хорошей динамикой и скорострельным и точным орудием, но имеет слабое бронирование и некомфортные углы вертикальной наводки.
      </p>
      <p>
        Опытная советская средняя самоходная артиллерийская установка (САУ) периода Второй мировой войны. Была создана в конструкторском осенью 1944 — весной 1945 года на основе шасси средних танков Т-44 и Т-34-85 и предназначалась для замены САУ СУ-100. Несмотря на перспективность САУ и высокие для своего времени характеристики, с окончанием войны было принято решение о прекращении дальнейших работ по ним, в связи с нецелесообразностью развёртывания выпуска новой САУ. Опыт работы над СУ-101 и СУ-102, вместе с тем, был использован в работах над послевоенными проектами САУ.
      </p>
    </section>
  </main>
</template>

<script>
export default {
  name: "MainPage",
  components: {}
};
</script>

<style lang="scss" scoped>
@import "@/styles/variables.scss";

.main {
  background: url(@/assets/images/Tank.jpg) 50% 50% no-repeat;
  @include background();
  color: var(--color-bg-task);
  overflow: auto;
  font-size: 0.9em;

  .section {
    border: 3px solid red;
    height: calc(100vh - 62px);

    h2 {
      margin-top: 10px;
      font-size: 1.3em;
    }

    p {
      text-align: justify;
      padding: 10px;
      margin-bottom: 0;
    }
  }
}
</style>
